Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase
The Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase class supports the handling of toolbar controls.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.#ctor(System.EventHandler,System.EventHandler,System.EventHandler,System.EventHandler,System.EventHandler)
Initializes a new instance of the Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase class.
onItemClicked: The method handling the click event for any of the returned items.
onItemHovered: The method handling the hover event for any of the returned items.
onItemStateChange: The method handling the change event for any of the returned items.
onItemGotKeyboardFocus: The method handling when item got keyboard focus.
onItemLostKeyboardFocus: The method handling when item lost keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.OnItemClicked
Gets the method handling the click event for any of the returned items.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.OnItemHovered
Gets the method handling the hover event for any of the returned items.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.OnItemStateChange
Gets the method handling the state change event for any of the returned items.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.OnItemGotKeyboardFocus
Gets the method handling event when item gets keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.OnItemLostKeyboardFocus
Gets the method handling event when item lost keyboard focus.

Tekla.Structures.DirectManipulation.Adapter.Controls.ToolBarControlHandlerBase.CreateItems(Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup)
Creates a collection of the UI controls for the given Tekla.BIM.DirectManipulation.Services.Controls.IControlsGroup.
controlsGroup: The group to wrap with instances of the UI controls.
Returns: A new collection of the UI controls wrapping the controlsGroup parameter.